# Exploration des données

In [1]:
import pandas as pd
dataFrame=pd.read_csv("job-data.csv", encoding='latin-1')

In [2]:
dataFrame.head(10)

,Company,Job Title,Location,Job Type,Experience level,Salary,Requirment of the company,Facilities
0,SGS,Clinical Data Analyst,"Richardson, TX, United States",Full Time,Entry-level,48K+ *,"Computer Science,Data quality,Genetics,Mathema...",",,,,"
1,Ocorian,AML/CFT & Data Analyst,"Ebène, Mauritius",Full Time,Entry-level,48K+ *,"Agile,Data management,Finance,Security,,",",,,,"
2,Cricut,Machine Learning Engineer,"South Jordan, UT, United States",Full Time,NaN,90K+ *,"Agile,Architecture,AWS,Computer Science,Comput...","Career development,,,,"
3,Bosch Group,Application Developer & Data Analyst,"Nonantola, Italy",Full Time,Entry-level,48K+ *,"Engineering,Industrial,Oracle,Power BI,R,R&D",",,,,"
4,Publicis Groupe,Data Engineer Full time (Public Sector) USA,"Arlington, VA, United States",Full Time,Mid-level,108K+,"AWS,Azure,Computer Science,Consulting,Dataflow...","Flex hours,Flex vacation,Parental leave,Unlimi..."
5,ServiceNow,Sr Staff Data Scientist - ATG,"Kirkland, Washington, United States",Full Time,Senior-level,184K+,"Computer Science,Deep Learning,Industrial,Mach...","401(k) matching,Career development,Competitive..."
6,Natixis in Portugal,Vendor Management and Data Quality Lead,"Porto, Portugal",Full Time,Entry-level,39K+ *,"Banking,Data quality,Excel,Security,,","Gear,,,,"
7,NielsenIQ,Intern (Business Intelligence Service Support),"Bangkok, Thailand",Internship,Entry-level,NaN,"Business Intelligence,Excel,Genetics,,,",",,,,"
8,Western Digital,Summer 2023 Data Engineering Intern,"San Jose, CA, United States",Internship,Entry-level,NaN,"Big Data,Computer Science,Engineering,Machine ...","Career development,Competitive pay,Equity,Flex..."
9,Palo Alto Networks,Principal Cloud Data Engineer (Prisma Access),"Santa Clara, CA, United States",Full Time,Senior-level,140K+,"Agile,APIs,AWS,Azure,Big Data,Computer Science","Career development,Medical leave,Salary bonus,..."

In [3]:
dataFrame.sample(10)

,Company,Job Title,Location,Job Type,Experience level,Salary,Requirment of the company,Facilities
2395,Wasoko,Business Intelligence Analyst,"Nairobi, KE",Full Time,Senior-level,48K+ *,"Agile,BigQuery,Business Intelligence,Data qual...","Startup environment,,,,"
127,ServiceNow,Machine Learning Engineer,"San Diego, CALIFORNIA, United States",Full Time,Senior-level,119K+,"Machine Learning,OOP,Python,Research,Testing,","401(k) matching,Career development,Competitive..."
1070,OUTsurance,Finance Data Analyst,"Centurion, South Africa",Full Time,Entry-level,30K+ *,"Azure,Computer Science,ETL,Excel,Finance,Power BI",",,,,"
2816,NiSUS Technologies,IC19DS1 - Associate Data Scientist - Cleared,"Annapolis Junction, Maryland, United States",Full Time,Mid-level,55K+ *,"Computer Science,Data analysis,Data Mining,Eng...","401(k) matching,Career development,Health care..."
1384,iwoca,Senior Data Scientist - UK Ops,"London, England, United Kingdom",Full Time,Mid-level,GBP 60K+,"Bayesian,Engineering,Machine Learning,Matlab,N...","Career development,Fitness / gym,Flex hours,Fl..."
944,Credera,Principal - Data Science,Los Angeles,Full Time,Senior-level,224K+,"Architecture,AWS,Azure,Cluster analysis,Comput...","401(k) matching,Career development,Competitive..."
34,Freeform,Senior Software Engineer (Data Pipeline),"Los Angeles, CA",Full Time,Senior-level,140K+,"Big Data,CI/CD,Computer Science,Computer Visio...","Career development,Equity,Flex hours,Flex vaca..."
2127,Verily,"Product Manager, Research - AI/ML & Data Science","Tel Aviv, Israel",Full Time,Senior-level,55K+ *,"Engineering,Finance,Machine Learning,Privacy,R...","Career development,Health care,,,"
1299,3Cloud,QA Data Engineer,Remote in Philippines,Full Time,NaN,96K+ *,"Agile,Azure,Computer Science,Databricks,ETL,Ja...","Competitive pay,Flex hours,Flex vacation,Salar..."
862,WHOOP,Senior Research Scientist,"Boston, MA",Full Time,Senior-level,89K+ *,"Data visualization,Deep Learning,Machine Learn...",",,,,"

On essai de afficher les premier lignes de notre data set pour just savoir sa forme.

<ul>
<li>Les valeurs NAN </li>
<p> est ce que on peut remplire ces valeur ? ou bien il faut les supprimer</p>
<li>list des <strong>facilities</strong></li>
<p>une list des que on peut la separer</p>
<li>forme de <strong>salary</strong> "48K+*" </li>
<p>des salaire avec des etoile ,cest quoi la senification de ces etoiles ?, on remarque que on a des salaire sans "*"</p>
<p>On remarque que les salaire sont on deferente davise il faut les unifier.(eur,£,$)</p>

<li>les  <strong>job title</strong> on deferente language il faut les unifier on oenlais ou bien en français </li>

<li>les  <strong>location</strong> on va les deviser par city,state county</li>


</ul>

In [6]:
print("list of unique Salary :",dataFrame["Salary"].sort_values(ascending=False).unique().tolist())

list of unique Salary : ['GBP 80K+', 'GBP 65K+', 'GBP 60K+', 'GBP 55K+', 'GBP 55K', 'GBP 54K+', 'GBP 51K+', 'GBP 50K+', 'GBP 45K+', 'GBP 42K+', 'GBP 35K', 'EUR 81K', 'EUR 80K+', 'EUR 60K+', 'EUR 36K+', 'EUR 130K+', ' 99K+', ' 98K+', ' 97K+', ' 96K+ *', ' 96K+', ' 95K+ *', ' 95K+', ' 94K+', ' 93K+', ' 92K+ *', ' 90K+ *', ' 90K+', ' 89K+ *', ' 86K+', ' 85K+', ' 84K+', ' 83K+', ' 82K+', ' 81K+ *', ' 81K+', ' 80K+ *', ' 80K+', ' 79K+', ' 78K+', ' 77K+ *', ' 76K+', ' 75K+ *', ' 75K+', ' 74K+ *', ' 74K+', ' 73K+ *', ' 73K+', ' 72K+', ' 71K+', ' 70K+ *', ' 70K+', ' 69K+ *', ' 68K+', ' 67K+', ' 66K+ *', ' 66K+', ' 65K+ *', ' 65K+', ' 63K+ *', ' 63K+', ' 62K+ *', ' 61K+ *', ' 60K+ *', ' 60K+', ' 59K+ *', ' 59K+', ' 57K+ *', ' 56K+ *', ' 55K+ *', ' 55K+', ' 54K+ *', ' 52K+', ' 51K+ *', ' 51K+', ' 50K+ *', ' 50K+', ' 49K+ *', ' 48K+ *', ' 45K+ *', ' 45K+', ' 44K+ *', ' 43K+', ' 42K+ *', ' 40K+ *', ' 40K+', ' 39K+ *', ' 36K+ *', ' 35K+ *', ' 33K+ *', ' 31K+ *', ' 315K+', ' 310K+', ' 30K+ *', ' 295K+', ' 283K+', ' 267K+', ' 253K+', ' 245K+', ' 236K+', ' 235K+', ' 234K+', ' 230K+', ' 227K+', ' 225K+', ' 224K+', ' 220K+', ' 218K+', ' 214K+', ' 207K+', ' 205K+', ' 204K+', ' 202K+', ' 200K+ *', ' 200K+', ' 199K+', ' 197K+', ' 196K+', ' 195K+', ' 193K+', ' 190K+', ' 189K+', ' 187K+', ' 185K+', ' 184K+ *', ' 184K+', ' 183K+', ' 182K+', ' 180K+', ' 179K+', ' 178K+', ' 177K+', ' 176K+', ' 175K+', ' 174K+', ' 173K+', ' 172K+', ' 171K+', ' 170K+', ' 168K+', ' 167K+', ' 166K+', ' 165K+', ' 164K+', ' 163K+', ' 161K+', ' 160K+', ' 159K+', ' 158K+', ' 157K+', ' 156K+', ' 155K+ *', ' 155K+', ' 154K+', ' 153K+', ' 152K+', ' 151K+', ' 150K+', ' 149K+', ' 148K+', ' 147K+', ' 146K+', ' 145K+', ' 144K+ *', ' 144K+', ' 143K+', ' 142K+', ' 141K+ *', ' 141K+', ' 140K+', ' 139K+', ' 138K+', ' 136K+', ' 135K+ *', ' 135K+', ' 134K+', ' 133K+', ' 132K+', ' 131K+ *', ' 131K+', ' 130K+', ' 129K+ *', ' 129K+', ' 128K+', ' 127K+', ' 126K+', ' 125K+', ' 124K+', ' 123K+', ' 122K+ *', ' 122K+', ' 121K+', ' 120K+ *', ' 120K+', ' 119K+', ' 117K+', ' 116K+', ' 115K+ *', ' 115K+', ' 113K+', ' 112K+', ' 111K+', ' 110K+ *', ' 110K+', ' 109K+ *', ' 109K+', ' 108K+', ' 107K+', ' 106K+', ' 105K+ *', ' 105K+', ' 104K+', ' 103K+ *', ' 103K+', ' 102K+ *', ' 102K+', ' 100K+ *', ' 100K+', nan]

In [5]:
dataFrame.Salary.sort_values(ascending=False)

1246    GBP 80K+
2536    GBP 65K+
1384    GBP 60K+
2492    GBP 55K+
2716     GBP 55K
          ...
3126         NaN
3134         NaN
3152         NaN
3159         NaN
3166         NaN
Name: Salary, Length: 3198, dtype: object

In [7]:
print("number of rows :",dataFrame.shape[0])

number of rows : 3198

In [8]:
print("number of columns :",str(dataFrame.shape[1])+" : "+ str(dataFrame.columns))

number of columns : 8 : Index(['Company', 'Job Title', 'Location', 'Job Type', 'Experience level',
       'Salary', 'Requirment of the company ', 'Facilities'],
      dtype='object')

In [9]:
dataFrame.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3198 entries, 0 to 3197
Data columns (total 8 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Company                     3197 non-null   object
 1   Job Title                   3197 non-null   object
 2   Location                    3197 non-null   object
 3   Job Type                    3197 non-null   object
 4   Experience level            2962 non-null   object
 5   Salary                      3009 non-null   object
 6   Requirment of the company   3198 non-null   object
 7   Facilities                  3198 non-null   object
dtypes: object(8)
memory usage: 200.0+ KB

In [10]:
dataFrame.describe()

,Company,Job Title,Location,Job Type,Experience level,Salary,Requirment of the company,Facilities
count,3197,3197,3197,3197,2962,3009,3198,3198
unique,1106,2138,1117,3,4,218,2600,777
top,Publicis Groupe,Data Engineer,"Bengaluru, India",Full Time,Senior-level,115K+ *,"Big Data,Business Intelligence,Data analysis,E...",",,,,"
freq,126,105,90,3116,1876,253,12,542

In [11]:
print("list of unique Job types :",dataFrame["Job Type"].unique())

list of unique Job types : ['Full Time' 'Internship' 'Part Time' nan]

In [12]:
print("list of unique Job Title :",dataFrame["Job Title"].unique())

list of unique Job Title : ['Clinical Data Analyst' 'AML/CFT & Data Analyst'
 'Machine Learning Engineer' ...
 'Application Integration Engineer, Computer Vision Program'
 'Senior Software Engineer, Machine Learning - Ads Intelligence'
 'Data Scientist - New College Graduate']

In [13]:
print("list of unique Experience level	 :",dataFrame["Experience level"].unique())

list of unique Experience level	 : ['Entry-level' nan 'Mid-level' 'Senior-level' 'Executive-level']

#### Duplicates

In [14]:
dataFrame.duplicated().sum()

202

In [15]:
dataFrame.drop_duplicates(inplace=True)

In [22]:
dataFrame.isna().sum()

Company                         0
Job Title                       0
Location                        0
Job Type                        0
Experience level              227
Salary                        171
Requirment of the company       0
Facilities                      0
dtype: int64

# Data Cleaning

#### Salary column

In [17]:
dataFrame["Salary"].isna().sum()

172

In [18]:
dataFrame["Salary"].str.strip()

0       48K+ *
1       48K+ *
2       90K+ *
3       48K+ *
4        108K+
         ...
3190     113K+
3191     106K+
3192     176K+
3193    39K+ *
3196    39K+ *
Name: Salary, Length: 2996, dtype: object

In [55]:
dataFrame[dataFrame["Salary"].isna()].sort_values('Location')

,Company,Job Title,Location,Job Type,Experience level,Salary,Requirment of the company,Facilities,Plus,Currency
669,bunq,Data Science Intern - Large Language Models,"Amsterdam, Noord-Holland, Netherlands",Internship,Entry-level,NaN,"Engineering,FinTech,LLMs,NLP,,","Career development,,,,",False,nan
973,bunq,Data Science Intern - Large Language Model,"Amsterdam, Noord-Holland, Netherlands",Internship,Entry-level,NaN,"Engineering,FinTech,LLMs,NLP,,","Career development,,,,",False,nan
3073,Definitive Logic,Data Science Intern,"Arlington, VA",Internship,Entry-level,NaN,"Big Data,Consulting,Consulting firm,Data analy...","Career development,Competitive pay,Flex hours,...",False,nan
1525,Cube RM,Business Data Analyst Intern,"Athens, Attica, Greece",Internship,Entry-level,NaN,"Agile,Azure,Computer Science,Data analysis,Exc...","Career development,Flex hours,Flex vacation,Ge...",False,nan
7,NielsenIQ,Intern (Business Intelligence Service Support),"Bangkok, Thailand",Internship,Entry-level,NaN,"Business Intelligence,Excel,Genetics,,,",",,,,",False,nan
...,...,...,...,...,...,...,...,...,...,...
1631,SYNTEGON,Working student Data Analytics & Reporting (m/...,"Waiblingen, Germany",Full Time,Entry-level,NaN,"Data analysis,Data Analytics,Engineering,Excel...","Startup environment,,,,",False,nan
1669,Dentons,Marketing Data Analyst Intern,"Warsaw, Masovian Voivodeship, Poland",Internship,Entry-level,NaN,"Data analysis,Excel,,,,",",,,,",False,nan
3166,DNSFilter,Senior Data Scientist,"Washington, District of Columbia, United State...",Full Time,Mid-level,NaN,"AWS,Computer Science,Data analysis,Data visual...","Career development,Flex hours,Flex vacation,He...",False,nan
44,REWE International Dienstleistungsgesellschaft...,Junior Data Science Engineer (m/w/x),"Wien, Austria",Full Time,Entry-level,NaN,"CI/CD,Computer Science,Data pipelines,Deep Lea...",",,,,",False,nan
1954,Opera,Data Scientist Summer Intern,"Wroclaw, PL",Part Time,Entry-level,NaN,"Computer Science,Data analysis,Data visualizat...","Startup environment,,,,",False,nan

In [20]:
dataFrame.dropna(thresh=3,inplace=True)

In [36]:
dataFrame[dataFrame["Salary"].isna()]

,Company,Job Title,Location,Job Type,Experience level,Salary,Requirment of the company,Facilities,Plus,Currency
7,NielsenIQ,Intern (Business Intelligence Service Support),"Bangkok, Thailand",Internship,Entry-level,NaN,"Business Intelligence,Excel,Genetics,,,",",,,,",NaN,nan
8,Western Digital,Summer 2023 Data Engineering Intern,"San Jose, CA, United States",Internship,Entry-level,NaN,"Big Data,Computer Science,Engineering,Machine ...","Career development,Competitive pay,Equity,Flex...",NaN,nan
39,Angi,Senior Data Scientist,"Indianapolis, IN - Hybrid",Full Time,Senior-level,NaN,"Big Data,Data Mining,Machine Learning,Mathemat...","401(k) matching,Career development,Competitive...",NaN,nan
44,REWE International Dienstleistungsgesellschaft...,Junior Data Science Engineer (m/w/x),"Wien, Austria",Full Time,Entry-level,NaN,"CI/CD,Computer Science,Data pipelines,Deep Lea...",",,,,",NaN,nan
75,Metiora,Data Analyst Intern,"Madrid, Spain",Full Time,Entry-level,NaN,"Matplotlib,MongoDB,NumPy,Pandas,Power BI,Python",",,,,",NaN,nan
...,...,...,...,...,...,...,...,...,...,...
3109,METRO/MAKRO,STAGE 6 mois - Data Scientist Junior H/F,"Nanterre, France",Full Time,Entry-level,NaN,"Big Data,Power BI,Python,R,SQL,",",,,,",NaN,nan
3134,Junglee Games,ETL and Data Warehouse Testing Intern,"Bengaluru, Karnataka, India",Internship,Entry-level,NaN,"Computer Science,Data quality,Data warehouse,E...",",,,,",NaN,nan
3152,Lely,"Stage: Computer Science, Robotics, Computer Vi...","Maassluis, Netherlands",Full Time,Entry-level,NaN,"Computer Science,Computer Vision,Engineering,O...",",,,,",NaN,nan
3159,Deezer,Data Analyst Intern m/f/d - Business,"Paris, France",Internship,Entry-level,NaN,"Data analysis,Data pipelines,Data visualizatio...","Career development,Health care,Insurance,Start...",NaN,nan
3166,DNSFilter,Senior Data Scientist,"Washington, District of Columbia, United State...",Full Time,Mid-level,NaN,"AWS,Computer Science,Data analysis,Data visual...","Career development,Flex hours,Flex vacation,He...",NaN,nan

In [56]:
dataFrame["Salary"].fillna('negociable',inplace=True)

In [70]:
dataFrame[dataFrame["Experience level"]=="Entry-level"]

,Company,Job Title,Location,Job Type,Experience level,Salary,Requirment of the company,Facilities,Plus,Currency
0,SGS,Clinical Data Analyst,"Richardson, TX, United States",Full Time,Entry-level,48000000.0,"Computer Science,Data quality,Genetics,Mathema...",",,,,",True,USD
1,Ocorian,AML/CFT & Data Analyst,"Ebène, Mauritius",Full Time,Entry-level,48000000.0,"Agile,Data management,Finance,Security,,",",,,,",True,USD
3,Bosch Group,Application Developer & Data Analyst,"Nonantola, Italy",Full Time,Entry-level,48000000.0,"Engineering,Industrial,Oracle,Power BI,R,R&D",",,,,",True,USD
6,Natixis in Portugal,Vendor Management and Data Quality Lead,"Porto, Portugal",Full Time,Entry-level,39000000.0,"Banking,Data quality,Excel,Security,,","Gear,,,,",True,USD
7,NielsenIQ,Intern (Business Intelligence Service Support),"Bangkok, Thailand",Internship,Entry-level,NaN,"Business Intelligence,Excel,Genetics,,,",",,,,",False,USD
...,...,...,...,...,...,...,...,...,...,...
3164,Rackspace,Trainee Data Engineer - R-16792,India - Remote,Full Time,Entry-level,59000000.0,"Architecture,Azure,Big Data,Computer Science,D...","Team events,,,,",True,USD
3170,Wise,"Data Analytics Manager - Compliance, Risk & In...",London,Full Time,Entry-level,120000000.0,"Airflow,APIs,Data Analytics,Data pipelines,Dat...",",,,,",True,USD
3176,iTech Media,Data Analytics Engineer,Warsaw Remote,Full Time,Entry-level,30000000.0,"Airflow,Data Analytics,Engineering,Finance,Kaf...","Career development,Flex hours,Flex vacation,He...",True,USD
3193,Western Digital,Data Scientist - New College Graduate,"Biñan, Philippines",Full Time,Entry-level,39000000.0,"APIs,Clustering,Computer Science,Data visualiz...","Career development,,,,",True,USD
3196,ATB Financial,Data Scientist,"Edmonton, Alberta, Canada",Full Time,Entry-level,39000000.0,"Computer Science,Data Analytics,Data Mining,Ec...","Career development,Startup environment,,,",True,USD

In [25]:
# pour les valeurs nan on salaire on va les remplacer par "negociable" pour le moment 
#return
# dataFrame["Salary"].replace(['negociable'],'',inplace=True)

In [80]:
# pour les valeurs nan on salaire on va les remplacer par "negociable" pour le moment 
dataFrame[dataFrame["Currency"]== "EUR"]

,Company,Job Title,Location,Job Type,Experience level,Salary,Requirment of the company,Facilities,Plus,Currency
324,Bosch Group,Master Data Management Plants (f/m/div.) (sala...,"Karlsruhe, Germany",Full Time,Entry-level,81000000.0,"Agile,Computer Science,Data analysis,Data mana...","Career development,Competitive pay,Salary bonus,,",False,EUR
456,Mozilla,Sr. Staff Machine Learning Engineer,Remote Germany,Full Time,Senior-level,130000000.0,"Architecture,AWS,Azure,Big Data,Computer Scien...","Career development,Flex vacation,Health care,H...",False,EUR
1057,Mozilla,"Staff Product Manager, Machine Learning and Re...",Remote Germany,Full Time,Senior-level,80000000.0,"Agile,Computer Science,Data management,Enginee...","Career development,Flex vacation,Health care,H...",False,EUR
1100,Metiora,Data Scientist Senior,"Madrid, Spain",Full Time,Senior-level,36000000.0,"Deep Learning,Machine Learning,Matplotlib,Mong...",",,,,",False,EUR
1117,CybelAngel,Senior Data Engineer,"Paris, Île-de-France, France - Remote",Full Time,Mid-level,60000000.0,"Airflow,BigQuery,Bigtable,Data analysis,Data g...","Career development,Equity,Salary bonus,,",False,EUR
1280,Evolution,Software Developer in Data Science Team,"Riga, Latvia",Full Time,Senior-level,36000000.0,"Agile,AWS,Big Data,Classification,Clustering,C...","Career development,Competitive pay,Health care...",False,EUR
1467,CITECH,Ingénieur Data / Power BI (H/F),"Dijon, France",Full Time,Senior-level,60000000.0,"Azure,Data Analytics,KPIs,PostgreSQL,Power BI,...",",,,,",False,EUR

Ajout  autre colonne de bonuses (primes).

In [25]:
dataFrame[['Salary', 'Plus']] = dataFrame["Salary"].apply(lambda x: pd.Series(str(x).split("+")))

In [40]:
dataFrame["Plus"].fillna('no bonuses',inplace=True)

Bonuses est une colonnes qui sinifier les primes (*).

In [43]:
dataFrame[dataFrame["Plus"]=='no bonuses']

,Company,Job Title,Location,Job Type,Experience level,Salary,Requirment of the company,Facilities,Plus,Currency
7,NielsenIQ,Intern (Business Intelligence Service Support),"Bangkok, Thailand",Internship,Entry-level,negociable,"Business Intelligence,Excel,Genetics,,,",",,,,",no bonuses,nan
8,Western Digital,Summer 2023 Data Engineering Intern,"San Jose, CA, United States",Internship,Entry-level,negociable,"Big Data,Computer Science,Engineering,Machine ...","Career development,Competitive pay,Equity,Flex...",no bonuses,nan
39,Angi,Senior Data Scientist,"Indianapolis, IN - Hybrid",Full Time,Senior-level,negociable,"Big Data,Data Mining,Machine Learning,Mathemat...","401(k) matching,Career development,Competitive...",no bonuses,nan
44,REWE International Dienstleistungsgesellschaft...,Junior Data Science Engineer (m/w/x),"Wien, Austria",Full Time,Entry-level,negociable,"CI/CD,Computer Science,Data pipelines,Deep Lea...",",,,,",no bonuses,nan
75,Metiora,Data Analyst Intern,"Madrid, Spain",Full Time,Entry-level,negociable,"Matplotlib,MongoDB,NumPy,Pandas,Power BI,Python",",,,,",no bonuses,nan
...,...,...,...,...,...,...,...,...,...,...
3109,METRO/MAKRO,STAGE 6 mois - Data Scientist Junior H/F,"Nanterre, France",Full Time,Entry-level,negociable,"Big Data,Power BI,Python,R,SQL,",",,,,",no bonuses,nan
3134,Junglee Games,ETL and Data Warehouse Testing Intern,"Bengaluru, Karnataka, India",Internship,Entry-level,negociable,"Computer Science,Data quality,Data warehouse,E...",",,,,",no bonuses,nan
3152,Lely,"Stage: Computer Science, Robotics, Computer Vi...","Maassluis, Netherlands",Full Time,Entry-level,negociable,"Computer Science,Computer Vision,Engineering,O...",",,,,",no bonuses,nan
3159,Deezer,Data Analyst Intern m/f/d - Business,"Paris, France",Internship,Entry-level,negociable,"Data analysis,Data pipelines,Data visualizatio...","Career development,Health care,Insurance,Start...",no bonuses,nan
3166,DNSFilter,Senior Data Scientist,"Washington, District of Columbia, United State...",Full Time,Mid-level,negociable,"AWS,Computer Science,Data analysis,Data visual...","Career development,Flex hours,Flex vacation,He...",no bonuses,nan

Ajout  autre colonne des devises.

In [28]:
dataFrame[['Currency','Salary']] = dataFrame["Salary"][dataFrame["Salary"]!="negociable"].apply(lambda x: pd.Series(str(x).split(" ")))

In [32]:
# les salaire avec des valeurs vides sont on dollar:
# dataFrame['Currency']=dataFrame['Currency'][dataFrame['Salary']=='negociable'].replace('negociable','USD',inplace=True)

In [29]:
dataFrame['Currency'].replace('','USD',inplace=True)

In [44]:
dataFrame['Plus'].replace('','no bonuses',inplace=True)

In [47]:
dataFrame['Plus'].replace(' *','bonuses',inplace=True)

In [49]:
dataFrame['Plus'] = dataFrame['Plus'].map({'bonuses': True, 'no bonuses': False})      # Replace string by boolean

In [61]:
print("list of unique Currency :",dataFrame["Currency"].unique().tolist())

list of unique Currency : ['USD', 'EUR', 'GBP']

In [60]:
dataFrame['Currency'].replace('nan','USD',inplace=True)

In [53]:
dataFrame['Salary'] = dataFrame['Salary'].str.replace('K', '')

In [64]:
# change tonumerique
dataFrame["Salary"]=pd.to_numeric(dataFrame['Salary'], errors='coerce')*1000

In [71]:
dataFrame["Salary"].fillna(0,inplace=True)

In [73]:
dataFrame.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2995 entries, 0 to 3196
Data columns (total 10 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Company                     2995 non-null   object
 1   Job Title                   2995 non-null   object
 2   Location                    2995 non-null   object
 3   Job Type                    2995 non-null   object
 4   Experience level            2768 non-null   object
 5   Salary                      2995 non-null   float64
 6   Requirment of the company   2995 non-null   object
 7   Facilities                  2995 non-null   object
 8   Plus                        2995 non-null   bool
 9   Currency                    2995 non-null   object
dtypes: bool(1), float64(1), object(8)
memory usage: 236.9+ KB

##### Experience level

In [77]:
print("list of unique Experience level :",dataFrame["Experience level"].unique().tolist())

list of unique Experience level : ['Entry-level', 'not-required', 'Mid-level', 'Senior-level', 'Executive-level']

In [76]:
dataFrame["Experience level"].fillna('not-required',inplace=True)

In [79]:
dataFrame["Experience level"]=dataFrame["Experience level"].str.replace('not-required','not-specified')

In [ ]:
#Categorier les "Experience level" colonnes